PinguinoIDE/pinguino-compilers/windows32/p8/share/gputils/header/p18f23k22.inc
C12IN0N          EQU  H'0000'
C12IN1N          EQU  H'0001'
VREFM            EQU  H'0002'
VREFP            EQU  H'0003'
T0CKI            EQU  H'0004'
SS               EQU  H'0005'

VREFN            EQU  H'0002'
SRQ              EQU  H'0004'
NOT_SS           EQU  H'0005'

CVREF            EQU  H'0002'
CCP5             EQU  H'0004'
LVDIN            EQU  H'0005'

DACOUT           EQU  H'0002'
HLVDIN           EQU  H'0005'

SS1              EQU  H'0005'

NOT_SS1          EQU  H'0005'

SRNQ             EQU  H'0005'


;----- PORTB Bits -----------------------------------------------------
RB0              EQU  H'0000'
RB1              EQU  H'0001'
RB2              EQU  H'0002'
RB3              EQU  H'0003'
RB4              EQU  H'0004'
RB5              EQU  H'0005'
RB6              EQU  H'0006'
RB7              EQU  H'0007'

INT0             EQU  H'0000'
INT1             EQU  H'0001'
INT2             EQU  H'0002'
CCP2_PORTB       EQU  H'0003'
KBI0             EQU  H'0004'
KBI1             EQU  H'0005'
KBI2             EQU  H'0006'
KBI3             EQU  H'0007'

AN12             EQU  H'0000'
AN10             EQU  H'0001'
AN8              EQU  H'0002'
AN9              EQU  H'0003'
AN11             EQU  H'0004'
AN13             EQU  H'0005'
TX2              EQU  H'0006'
RX2              EQU  H'0007'

FLT0             EQU  H'0000'
C12IN3M          EQU  H'0001'
P1B              EQU  H'0002'
C12IN2M          EQU  H'0003'
T5G              EQU  H'0004'
T1G              EQU  H'0005'
CK2              EQU  H'0006'
DT2              EQU  H'0007'

SRI              EQU  H'0000'
C12IN3N          EQU  H'0001'
CTED1            EQU  H'0002'
C12IN2N          EQU  H'0003'
P1D              EQU  H'0004'
CCP3_PORTB       EQU  H'0005'
PGC              EQU  H'0006'
PGD              EQU  H'0007'

CCP4             EQU  H'0000'
P1C              EQU  H'0001'
SDA2             EQU  H'0002'
CTED2            EQU  H'0003'
T3CKI_PORTB      EQU  H'0005'

SS2              EQU  H'0000'
SCL2             EQU  H'0001'
SDI2             EQU  H'0002'
P2A_PORTB        EQU  H'0003'
P3A_PORTB        EQU  H'0005'

NOT_SS2          EQU  H'0000'
SCK2             EQU  H'0001'
SDO2             EQU  H'0003'
P2B_PORTB        EQU  H'0005'


;----- PORTC Bits -----------------------------------------------------
RC0              EQU  H'0000'
RC1              EQU  H'0001'
RC2              EQU  H'0002'
RC3              EQU  H'0003'
RC4              EQU  H'0004'
RC5              EQU  H'0005'
RC6              EQU  H'0006'
RC7              EQU  H'0007'

T1OSO            EQU  H'0000'
T1OSI            EQU  H'0001'
T5CKI            EQU  H'0002'
SCK              EQU  H'0003'
SDI              EQU  H'0004'
SDO              EQU  H'0005'
TX               EQU  H'0006'
RX               EQU  H'0007'

P2B_PORTC        EQU  H'0000'
P2A_PORTC        EQU  H'0001'
P1A              EQU  H'0002'
SCL              EQU  H'0003'
SDA              EQU  H'0004'
CK               EQU  H'0006'
; DT is a reserved word
; DT               EQU  H'0007'

T1CKI            EQU  H'0000'
CCP2_PORTC       EQU  H'0001'
CCP1             EQU  H'0002'
SCK1             EQU  H'0003'
SDI1             EQU  H'0004'
SDO1             EQU  H'0005'
TX1              EQU  H'0006'
RX1              EQU  H'0007'

T3CKI_PORTC      EQU  H'0000'
CTPLS            EQU  H'0002'
SCL1             EQU  H'0003'
SDA1             EQU  H'0004'
CK1              EQU  H'0006'
DT1              EQU  H'0007'

T3G              EQU  H'0000'
AN14             EQU  H'0002'
AN15             EQU  H'0003'
AN16             EQU  H'0004'
AN17             EQU  H'0005'
AN18             EQU  H'0006'
AN19             EQU  H'0007'

CCP3_PORTC       EQU  H'0006'
P3B              EQU  H'0007'

P3A_PORTC        EQU  H'0006'


;----- PORTE Bits -----------------------------------------------------
RE3              EQU  H'0003'

MCLR             EQU  H'0003'

NOT_MCLR         EQU  H'0003'

VPP              EQU  H'0003'


;----- LATA Bits -----------------------------------------------------
LATA0            EQU  H'0000'
LATA1            EQU  H'0001'
LATA2            EQU  H'0002'
LATA3            EQU  H'0003'
LATA4            EQU  H'0004'
LATA5            EQU  H'0005'
LATA6            EQU  H'0006'
LATA7            EQU  H'0007'


;----- LATB Bits -----------------------------------------------------
LATB0            EQU  H'0000'
LATB1            EQU  H'0001'
LATB2            EQU  H'0002'
LATB3            EQU  H'0003'
LATB4            EQU  H'0004'
LATB5            EQU  H'0005'
LATB6            EQU  H'0006'
LATB7            EQU  H'0007'


;----- LATC Bits -----------------------------------------------------
LATC0            EQU  H'0000'
LATC1            EQU  H'0001'
LATC2            EQU  H'0002'
LATC3            EQU  H'0003'
LATC4            EQU  H'0004'
LATC5            EQU  H'0005'
LATC6            EQU  H'0006'
LATC7            EQU  H'0007'


;----- DDRA Bits -----------------------------------------------------
TRISA0           EQU  H'0000'
TRISA1           EQU  H'0001'
TRISA2           EQU  H'0002'
TRISA3           EQU  H'0003'
TRISA4           EQU  H'0004'
TRISA5           EQU  H'0005'
TRISA6           EQU  H'0006'
TRISA7           EQU  H'0007'

RA0              EQU  H'0000'
RA1              EQU  H'0001'
RA2              EQU  H'0002'
RA3              EQU  H'0003'
RA4              EQU  H'0004'
RA5              EQU  H'0005'
RA6              EQU  H'0006'
RA7              EQU  H'0007'


;----- TRISA Bits -----------------------------------------------------
TRISA0           EQU  H'0000'
TRISA1           EQU  H'0001'
TRISA2           EQU  H'0002'
TRISA3           EQU  H'0003'
TRISA4           EQU  H'0004'
TRISA5           EQU  H'0005'
TRISA6           EQU  H'0006'
TRISA7           EQU  H'0007'

RA0              EQU  H'0000'
RA1              EQU  H'0001'
RA2              EQU  H'0002'
RA3              EQU  H'0003'
RA4              EQU  H'0004'
RA5              EQU  H'0005'
RA6              EQU  H'0006'
RA7              EQU  H'0007'


;----- DDRB Bits -----------------------------------------------------
TRISB0           EQU  H'0000'
TRISB1           EQU  H'0001'
TRISB2           EQU  H'0002'
TRISB3           EQU  H'0003'
TRISB4           EQU  H'0004'
TRISB5           EQU  H'0005'
TRISB6           EQU  H'0006'
TRISB7           EQU  H'0007'

